# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

brew "git"
brew "zsh"
brew "zsh-completions"
brew "bat"
brew "node"
brew "yarn"
brew "nvm"
brew "sheldon"
brew "tree"
brew "gnupg"
brew "wget"
brew "terminal-notifier"
brew "starship"
brew "jq"
brew "exa"

# Window management
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

# Fonts
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono"
cask "font-symbols-only-nerd-font"

cask "1password"

# Development
cask "visual-studio-code"
cask "postman"

# Go
brew "go"

brew "docker"
brew "helm"
brew "kind"
brew "kubernetes-cli"

cask "spotify"
cask "1password"

# Neovim
brew "neovim"
brew "tree-sitter"
brew "fzf"
brew "fd"
brew "ripgrep"
