# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle
brew "git"
brew "bat"
brew "node"
brew "yarn"
brew "nvm"
brew "gnupg"
brew "wget"
brew "terminal-notifier"
brew "jq"
brew "eza"
brew "zoxide"

cask "shottr"

# Window management
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

# Fonts
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono"
cask "font-symbols-only-nerd-font"

cask "1password"

# Development
cask "visual-studio-code"
cask "postman"

brew "colima"
brew "docker"
brew "docker-compose"

# Go
brew "go"

brew "kind"
brew "kubernetes-cli"

cask "spotify"
cask "1password"

# Neovim
brew "neovim"
brew "tree-sitter"
brew "fzf"
brew "fd"
brew "ripgrep"
